export interface IData {
  control: any[]
  data: any[]
}

export const Data: IData = {control: [
  {
    list: [],
  },
  {
    list: [],
  },
  {
   list: [],
  }
 ],
  data: [
  {
    list: [["開1.super rolling", 5], ["開2.滑腳（新搭配：回馬槍畫手雀升）", 4], ["開3.側手膝滑", 3.5], ["開4.跳轉風火輪", 3.5], ["開5.",0], ["開6.",0], ["開7.",0]],
  },
  {
    list: [["G1.屁上畫畫 go down", 4], ["G2.跳水 go down", 4.5], ["G3.逆旋丟", 4], ["G4.抓咪咪 go down", 3.5], ["G5.膝蓋位移 go down", 3.5], ["G6.Up down", 3.5], ["G7.單手 raiz 飛 knee drop", 4], ["G8.stop and go", 4], ["G9.開手丟 knee drop", 3], ["G10.Say hello", 4], ["G11.", 0], ["G12.", 0]], // Go down
  },
  {
    list: [["FO1.腳跟雨刷排（地面加手板）", 4], ["FO2.海獅排腿", 4], ["FO3.甩腳排腿", 4], ["FO4.內鑽膝蓋排", 3.5], ["FO5.夾餅乾排腿", 4], ["FO6.無限 hook 排", 4], ["FO7.起跑定格排腿", 1], ["FO8.側卍排腿（變化）", 3], ["FO9.機架排腿", 4.5], ["FO10.單腳三排", 4.5], ["FO11.拋排腿", 4], ["FO12.Raiz 排腿", 3.5], ["FO13.內塞腳滑", 3], ["FO14.江南排腿+kick三排", 4], ["FO15.耳鳴排腿", 3], ["FO16.播皮", 2], ["FO17.單手伏地挺身排", 3], ["FO18.螺絲排腿", 3], ["FO19.棒子交叉爬排", 2], ["FO20.跪膝勾腳蹲踢", 3.5], ["FO21.小機架SLIDE排", 2],["FO22.塞膝蓋踩hook", 3], ["FO23.", 0], ["FO24.", 0], ["FO25.", 0]],
  },
  {
    list: [["B1.腳跟 back rock", 4], ["B2.仰臥起坐", 4], ["B3.後滾腳大跳", 2], ["B4.反鐘擺", 3], ["B5.", 0], ["B6.", 0], ["B7.", 0]]
  },
  {
    list: [["P1.雀拋段", 5], ["P2.大單側滑", 5], ["P3.快速側刷", 4.5], ["P4.拋鑽石開手", 3.5], ["P5.大單塞肩", 3.5], ["P6.並腿拋劈腿上", 4], ["P7.踩踩跳轉", 5], ["P8.自由落體", 3], ["P9.跳轉tap set", 4], ["P10.膝蓋風", 3.5], ["P11.機架拋", 3], ["P12.雀拋丟繞膝蓋", 3], ["P13.拋肘側刷肩", 3], ["P14.並腿雀拋 1.5", 3], ["P15.風車單手拍拋", 3.5], ["P16.NIKE風拋", 3.5], ["P17.風彈腳", 4], ["P18.平拋", 3], ["P19.", 0]]
  },
  {
    list: [["F1.彈力球降雀", 4], ["F2.左左右右", 5], ["F3.肘丟肩上", 3.5], ["F4.丟機架", 4], ["F5.章魚肩上", 3.5], ["F6.吊腰", 4], ["F7.畫手頭頂", 4], ["F8.鐵頭功", 4.5], ["F9.", 0], ["F10.", 0], ["F11.", 0]]
  },
  {
    list: [["孫1.蛋轉鐘擺手", 5], ["孫2.鐘擺段end", 5], ["孫3.踩踩跳轉", 5], ["孫4.小後翻鑽頭", 4.5], ["孫5.跳轉丟滑開腳章魚", 3.5], ["孫6.拋胸口後拉手", 3], ["孫7.頭搬手", 4], ["孫8.旋轉木馬", 3.5], ["孫9.跳轉拋 1.5 拍手腳踝", 4], ["孫10.Ｘ手丟 -> Ｘ手倒", 3], ["孫11.彈塗魚", 2], ["孫12.手滑掉", 2], ["孫13.畫手開丟", 4], ["孫14.變魔術", 2.5], ["孫15.左倒右倒", 1], ["孫16.拍手跳水（兩邊）", 1], ["孫17.屁鞍", 2], ["孫18.Ｘ趴倒", 3.5], ["孫19.烏溜塞頭滑", 3.5], ["孫20.一竿清檯", 4], ["孫21.", 0], ["孫22.", 0], ["孫23.", 0]]
  },
]};

export default Data;
